{"_id":{"$oid":"656e27f361c3f0c55ac20faa"},"Title":"The Predator","Description":"Dutch (Arnold Schwarzenegger), a soldier of fortune, is hired by the U.S. government to secretly rescue a group of politicians trapped in Guatemala. But when Dutch and his team, and their crew, are transported to which includes weapons expert Blain (Jesse Ventura) and CIA agent George (Carl Weathers), land in Central America, something is gravely wrong. After finding a string of dead bodies, the crew discovers they are being hunted by a brutal creature with superhuman strength and the ability to disappear into its surroundings.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"John McTiernan","Bio":"John Campbell McTiernan Jr. is an American filmmaker. He is best known for his action films, including Predator, Die Hard, and The Hunt for Red October.","Birth":"1951"},"ImagePath":"The Predator.png","Featured":true,"Actors":["Arnold Schwarzenegger"]}
{"_id":{"$oid":"656e3d1561c3f0c55ac20fab"},"Title":"The Fountain","Description":"As a 16th-century conquistador, Tomas searches for the legendary Fountain of Youth. As a present-day scientist, he desperately struggles to cure the cancer that is killing his wife.","Genre":{"Name":"Drama","Description":"Drama, Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama."},"Director":{"Name":"Darren Aaronofsky","Bio":"Darren Aaronofsky is the founder and CEO of the American Institute of Motion Picture Art and Technology","Birth":"1968"},"ImagePath":"TheFountain.png","Featured":true}
{"_id":{"$oid":"656e44b361c3f0c55ac20fac"},"Title":"Transformers","Description":"Humanity's fate hinges on a war between the Autobots and Decepticons, shape-shifting robots, on Earth. The key to ultimate power is sought after by both sides, with only young Sam Witwicky (Shia LaBeouf) able to prevent global destruction","Genre":{"Name":"Action","Description":"Action contain numerous scenes where action is spectacular and usually destructive. Often includes non-stop motion, high energy physical stunts, chases, battles, and destructive crises (floods, explosions, natural disasters, fires, etc."},"Director":{"Name":"Michael Bay","Bio":"Super action director Michael Benjamin Bay is an American film director and producer. He is best known for making big-budget, high-concept action films characterized by fast cutting, stylistic cinematography and visuals, and extensive use of special effects, including frequent depictions of explosions.","Birth":"1965"},"ImagePath":"Transformers.png","Featured":true}
{"_id":{"$oid":"656e452e61c3f0c55ac20fad"},"Title":"Transformers 2","Description":"Two years after defeating the Decepticons, Sam Witwicky (Shia LaBeouf) starts college while Optimus Prime and the Autobots ally with a secret military group on Earth. Facing the threat of The Fallen, an ancient Decepticon, Sam and his girlfriend, Mikaela, must uncover the Transformers Earth history to defeat The Fallen.","Genre":{"Name":"Action","Description":"Action contain numerous scenes where action is spectacular and usually destructive. Often includes non-stop motion, high energy physical stunts, chases, battles, and destructive crises (floods, explosions, natural disasters, fires, etc."},"Director":{"Name":"Michael Bay","Bio":"Super action director Michael Benjamin Bay is an American film director and producer. He is best known for making big-budget, high-concept action films characterized by fast cutting, stylistic cinematography and visuals, and extensive use of special effects, including frequent depictions of explosions.","Birth":"1965"},"ImagePath":"Transformers.png","Featured":true}
{"_id":{"$oid":"656e465a61c3f0c55ac20fae"},"Title":"Terminator","Description":"A crazed cyborg assassin, the Terminator (Arnold Schwarzenegger), travels from 2029 to 1984 to kill Sarah Connor (Linda Hamilton). Kyle Reese (Michael Biehn) is sent to protect her, revealing the threat of Skynet, an AI that will cause a nuclear holocaust. Sarah is targeted as her unborn son will lead the resistance. She and Kyle try to evade the relentless Terminator.","Genre":{"Name":"Action","Description":"Action contain numerous scenes where action is spectacular and usually destructive. Often includes non-stop motion, high energy physical stunts, chases, battles, and destructive crises (floods, explosions, natural disasters, fires, etc."},"Director":{"Name":"James Cameron","Bio":"James Cameron is a highly influential Canadian filmmaker, known for his groundbreaking work in the science fiction and epic genres. He has gained fame for creating visually spectacular and technically innovative films. Cameron's notable works include The Abyss, True Lies, Titanic, and Avatar.","Birth":"1954"},"ImagePath":"Terminator.png","Featured":true}
{"_id":{"$oid":"656e474461c3f0c55ac20faf"},"Title":"Terminator 2","Description":"Eleven years after The Terminator, John Connor, vital for future victory over robots, is hunted by the shape-shifting T-1000, a Terminator from the future. The upgraded T-800 (Arnold Schwarzenegger) is sent to protect him. John and his mother, aided by the T-800, flee, as John unexpectedly bonds with the robot.","Genre":{"Name":"Action","Description":"Action contain numerous scenes where action is spectacular and usually destructive. Often includes non-stop motion, high energy physical stunts, chases, battles, and destructive crises (floods, explosions, natural disasters, fires, etc."},"Director":{"Name":"James Cameron","Bio":"James Cameron is a highly influential Canadian filmmaker, known for his groundbreaking work in the science fiction and epic genres. He has gained fame for creating visually spectacular and technically innovative films. Cameron's notable works include The Abyss, True Lies, Titanic, and Avatar.","Birth":"1954"},"ImagePath":"Terminator 2.png","Featured":true}
{"_id":{"$oid":"656e487861c3f0c55ac20fb0"},"Title":"The Wolverine","Description":"In Japan, the century-old mutant Wolverine (Hugh Jackman) encounters yakuza and samurai, facing physical and emotional challenges. He protects an industrialist's daughter, confronts mortality, battles formidable enemies, and deals with his haunted past.","Genre":{"Name":"Action","Description":"Action contain numerous scenes where action is spectacular and usually destructive. Often includes non-stop motion, high energy physical stunts, chases, battles, and destructive crises (floods, explosions, natural disasters, fires, etc."},"Director":{"Name":"James Mangold","Bio":"James Mangold is an American film director, screenwriter, and producer known for his versatile filmmaking style. He has directed a variety of films across different genres, including the psychological thriller Girl, Interrupted, the romantic comedy Kate & Leopold, the biographical drama, Walk the Line, and The Western , 3:10 to Yuma.","Birth":"1963"},"ImagePath":"TheWolverine.png","Featured":true}
{"_id":{"$oid":"656e498e61c3f0c55ac20fb1"},"Title":"Hero","Description":"In an ancient Chinese martial arts epic, an unnamed warrior (Jet Li) is celebrated for defeating the king's three formidable enemies. As he recounts his battles with assassins Broken Sword, Flying Snow, and Moon, the king doubts his stories and suggests alternative versions of the events.","Genre":{"Name":"Drama","Description":"Drama, Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama."},"Director":{"Name":"Zhang Yimou","Bio":"Zhang Yimou is a celebrated Chinese film director, producer, and cinematographer. He is one of the leading figures of the Fifth Generation of Chinese cinema, known for his visually stunning and emotionally powerful storytelling.","Birth":"1951"},"ImagePath":"Herothemovie.png","Featured":true}
{"_id":{"$oid":"656e4bf461c3f0c55ac20fb2"},"Title":"The Matrix","Description":"The Matrix is a groundbreaking sci-fi action film set in a dystopian future where humanity is unknowingly trapped in a simulated reality called the Matrix, created by intelligent machines. The story follows Thomas Anderson, a computer programmer who leads a double life as the hacker Neo. After discovering the truth about the Matrix, Neo joins a group of rebels led by Morpheus and Trinity. They fight against the machines and work to free humanity from this artificial world, while Neo grapples with his role as the prophesied One who can end the war.","Genre":{"Name":"Sci-Fi","Description":"Sci-Fi, numerous scenes, and or the entire background for the setting of the narrative, should be based on speculative scientific discoveries or developments, environmental changes, space travel, or life on other planets."},"Director":{"Name":"The Wichowski Brothers","Bio":" TheWachowskis are known for their imaginative storytelling and exploration of complex themes such as reality, identity, and the humanity relationship with technology. They have also been influential in their visible transition from male to female, becoming two of the most prominent transgender figures in the film industry. Their work has significantly impacted modern science fiction and action genres.","Birth":"1951"},"ImagePath":"The Matrix.png","Featured":true}
{"_id":{"$oid":"656e4d2d61c3f0c55ac20fb3"},"Title":"Free Guy","Description":"A bank teller realizes he's a background character in a video game and decides to become the hero of his own story. In a limitless world, he aims to save the day on his terms and possibly romance the coder who created him.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Shawn Levy","Bio":" Shawn Levy is a Canadian film director, producer, and actor. He is widely recognized for his work in the comedy and family genres. Levy's notable directing credits include films such as Cheaper by the Dozen, The Pink Panther, Night at the Museum series, and Real Steel. His films are known for their broad appeal, combining humor with heartwarming themes","Birth":"1968"},"ImagePath":"Freeguy.png","Featured":true}
